Repository: tryswift/try-swift-tokyo
Catalog: MyLibrary/Sources/ScheduleFeature/Localizable.xcstrings
Source language: en
Languages: ja

source: The reason why I'd like to give this talk is because as someone who works as both an iOS/Mac developer and a security researcher, I've learned that there's a lot that the developer community can contribute to security research on Apple's platforms, but most developers think that it's a niche outside their area of expertise. However, most professional security researchers focus at the low level where app developers don't usually have a lot of knowledge. Through my work, I've found quite a few security bugs in Mac and iOS that could be found at the higher level, and those bugs have rewarded me with multiple bug bounty payments from Apple as well as helping improve the security of the operating systems. This talk would be a way to introduce more developers to the practice, with some examples of my past experiences, and encourage them to pursue security research as part of their career. You can read about some of my security research work on my blog. I think this fits well as both an inspirational and technical topic that's not usually covered in developer conferences.
ja: 私自身、iOS/Macの開発者でありながらセキュリティリサーチャーとしても活動してきた経験から、Appleプラットフォームにおけるセキュリティリサーチに、開発者コミュニティが大いに貢献できることを学びました。しかし、多くの開発者はこの分野を自分の専門外のニッチなものと捉えがちです。一方で、プロのセキュリティリサーチャーは、アプリ開発者があまり触れない低レベルの部分に注力する傾向にあります。 私のこれまでの活動では、MacやiOSの上位レベルで発見可能なセキュリティ脆弱性をいくつか見つけ、その結果としてAppleから複数のバグバウンティ報奨金を得るとともに、OSのセキュリティ向上にも寄与してきました。このトークでは、私の過去の経験を交えながら、より多くの開発者がセキュリティリサーチの実践に触れるきっかけを提供し、キャリアの一環として挑戦することを後押しします。詳しい事例は私のブログでも紹介しています。 この内容は、技術的な側面とインスピレーショナルな視点の両方を兼ね備え、開発者カンファレンスではあまり取り上げられない貴重なトピックだと考えています。

source: This talk will take you through a handful of topics that either make a big or a small win for you or your application, mostly with the new iOS, SwiftUI and Xcode features. Want to give your app some extra sparkle? Let's chat about cool shortcuts, playful animations, and the new tricks from SwiftUI 5 like observation framework, enhanced phased animations, updates to scrollview and new gestures. Come join this session and take home some big and small wins with you.
ja: この講演では、新しいiOS、SwiftUI、そしてXcodeの特徴を活用して、あなたやアプリにとっての成果や進歩を促す様々なテーマを紹介します。アプリをさらに魅力的にしたいですか？便利なショートカット、楽しいアニメーション、SwiftUI 5から導入された新機能、例えばObservationフレームワーク、進化した段階的アニメーション、スクロールビューの更新、新しいジェスチャーなどについて話し合います。このセッションに参加し、あなたのアプリ開発に役立つヒントや知識を得てください。

source: Tim is a Swift developer from Manchester, UK and part of the Vapor Core Team. He's part of the server-side Swift team at Kodeco and has written the unofficial-official book on Vapor with the founders of the framework. He founded Broken Hands a few years ago and delivers talks and workshops on Vapor and server-side Swift around the world. He also co-organises the ServerSide.swift conference - the world’s first and only conference focused on server-side Swift.
ja: Tim はイギリス、マンチェスター出身の Swift 開発者で、Vapor コアチームの一員です。彼はKodecoのサーバーサイドSwiftチームの一員であり、フレームワークの創設者たちと共にVaporの非公式公式本を執筆している。数年前にBroken Handsを設立し、VaporとサーバーサイドSwiftに関する講演やワークショップを世界中で行っている。また、ServerSide.swiftカンファレンス（サーバーサイドSwiftに焦点を当てた世界初で唯一のカンファレンス）を共同主催している。

source: Transforming Language Learning with AI: A Deep Dive into Duolingo’s AI Tutor
ja: AIによる言語学習の変革：DuolingoのAIチューターを深掘る

source: Understanding HDR
ja: HDRを理解する

source: Understanding Render Loop to optimise SwiftUI
ja: SwiftUI を最適化するためのレンダーループの理解

source: Unique to Apple Vision Pro! How to Start Developing Spatial Apps
ja: Apple Vision Proならでは！ 空間アプリ開発の始め方

source: Unlock the Potential of Swift Code Generation
ja: Swiftコード生成の可能性を解き放て

source: Unlocking the Boundless Potential of SF Symbols, "The Artistic World of SF Symbols"
ja: SF Symbolsの芸術的世界：限りない可能性を解き放つ

source: Using the Accessibility API in macOS allows you to access and manipulate UI elements of other applications and retrieve the content displayed. This presentation will introduce methods to add assistant features such as autocomplete and translation to existing applications by utilizing this functionality. We will discuss the application of the Accessibility API to enhance applications, including practical examples.
ja: macOSのAccessibility APIを利用すると他のアプリケーションのUI要素にアクセスして操作したり表示されているコンテンツを取得できます。この機能を用いて既存のアプリケーションに自動補完や翻訳機能などのアシスタント機能を追加する方法を紹介します。Accessibility APIのアプリケーションを拡張するための応用について、実例を交えて説明します。

source: Vapor has undergone a large number of significant changes over the last few years. The bio of Swift Concurrency, Sendable and rewriting the internals to use new async foundations have all posed big problems as we've had to migrate and adapt without breaking anything, continuing to ship and keeping our API stable! In this talk we'll go through some war stories of these migrations and learn some practical steps that you can use in your codebase to make big changes without grinding to a halt or breaking everything. This talk is applicable to all Swift developers, whether writing libraries, iOS applications or even server apps!
ja: Vaporはここ数年で大きな変化を遂げてきました。Swiftの並行処理やSendableの導入、内部の書き直しによる新しい非同期基盤の使用など、これらの変更はすべて、何も壊さずに移行し、適応し、引き続き安定したAPIを提供し続けるという大きな課題をもたらしました！このトークでは、そんな移行の際の戦いについてのエピソードを共有し、コードベースで大きな変更を行う際の実践的な手順を学びます。このトークは、Swiftの開発者であれば、ライブラリを書いたり、iOSアプリケーションを作成したり、サーバーアプリケーションを開発したりするすべての人に役立つ内容です！

source: Vincent works at Photoroom and contributes to building great consumer apps. He also enjoys sharing about Swift and iOS on his YouTube channel.
ja: VincentはPhotoroomで働きながら、優れたコンシューマー向けアプリの開発に携わっています。また、SwiftやiOSに関する情報をYouTubeチャンネルで発信することも楽しんでいます。

source: Vision Pro × Text to 3D Model: How Swift and Generative AI Unlock a New Era of Spatial Computing
ja: Vision Pro × Text to 3D Model: Swiftと生成型AIが切り拓く新時代の空間コンピューティング

source: visionOS represents a new paradigm known as Spatial Computing, which is expected to significantly increase the number of experiences available on headset devices. This talk will introduce the basic concepts of visionOS and provide explanations on implementing sample apps using Swift. Given that many may not have developed for visionOS or have experience with SwiftUI or RealityKit, understanding every aspect is not necessary. By learning the basic architecture, you can start implementing spatial applications. The session will cover the process from project creation to operation, with spatial expressions explained through demos and videos. Let's create experiences in Spatial Computing together!
ja: visionOSはSpatial Compuingという新たなパラダイムを示しています。 今後ヘッドセット型端末での体験が数多く提供されてゆくでしょう。 このトークではvisionOSの基本的な概念の解説をし Swiftを使ったサンプルアプリ実装の説明をします。 まだ現時点ではvisionOSでの開発をしたことがない方が多いでしょう。 SwiftUI、RealityKitの実装経験がない方もまた多いと思います。 すべてを理解する必要はなく、基本的な構成を学習すれば あなたも空間的なアプリを実装することができます。 プロジェクト作成から動作までの流れを解説し 空間的表現をデモと動画で説明します。 Spatial Computingの体験を皆でつくっていきましょう！

source: We all know Swift is great for buildings apps on iOS, macOS, and other Apple platforms, but it can do so much more. In this talk you'll learn how to leverage result builders to generate HTML, then how to use that as a foundation for building whole websites in Swift.
ja: SwiftはiOS、macOS、その他のAppleプラットフォームでアプリを構築するのに適していることで知られていますが、それだけではありません。この講演では、Result Builderを利用してHTMLを生成する方法と、それを基盤としてSwiftで完全なウェブサイトを構築する方法について学びます。

source: We all know that the NS prefix on the Apple platforms comes NextStep. However, until I built an app for NextStep, I did not realize just how much was already there. In this quick talk, I encourage attendees to deepen their knowledge of Objective C and Apple Platforms by stepping back in time to 1996
ja: AppleプラットフォームにおけるNSプレフィックスがNextStepに由来することは、誰もが知っています。しかし、私がNextStep向けのアプリを作るまでは、その技術がどれほど充実しているかに全く気づいていませんでした。この短いトークでは、1996年にタイムスリップすることで、Objective-CとAppleプラットフォームに対する理解をさらに深めることを皆さんに提案します。

source: What Can We Do Without AI in the Future?
ja: AIがない未来を考える

source: What can you do with Path animations in SwiftUI? With some creativity, we can animate text, draw shapes, and more—it's a surprisingly versatile technique. In this talk, I'll showcase innovative ways to use Path animations in development and entertainment, helping you dive into this exciting world.
ja: SwiftUIのPathアニメーションで、どんなことができるのでしょうか？ 少しの創意工夫で、テキストをアニメーションさせたり、図形を描いたりと、驚くほど多彩な表現が可能です。 このトークでは、開発やエンターテインメントの分野においてPathアニメーションを活用する革新的な方法をご紹介し、皆さんをこの刺激的な世界へと誘います。

source: What makes an app truly exceptional? How do the best designers create interfaces that feel intuitive, delightful, and, most importantly, human? In this talk, Sebastiaan de With pulls back the curtain on Apple's design principles and the craftsmanship behind Halide, an Apple Design Award-winning app. From refining tiny details to making tough design decisions, he'll share real-world insights on creating products that aren't just great—they're loved. Whether you're an aspiring designer or a seasoned developer, jump into a no-nonsense crash course in shipping beautiful, functional apps without getting lost in perfectionism.
ja: アプリを真に卓越させる要素は何でしょうか？ 最良のデザイナーたちは、どのようにして直感的で魅力的、そして何よりも人間味あふれるインターフェースを生み出しているのでしょうか？ このトークでは、Seebastiaan de WithがAppleのデザイン原則と、Apple Design Awardを受賞したHalideの背後にある職人技に迫ります。 細部の洗練から、難しいデザイン判断に至るまで、単に優れているだけでなく、人々に愛される製品を生み出すための実践的な知見を共有します。 新進のデザイナーであれ、経験豊富な開発者であれ、完璧主義にとらわれることなく、美しく機能的なアプリを世に送り出すための、実践的なクラッシュコースにぜひ飛び込んでみましょう。

source: What's new in iOS 17, 16, 15, etc.
ja: iOS 17, 16, 15などの新機能

source: When you have more app or game ideas than time to implement them, AI can help accelerate your workflow, generating code, assets, tests, and documentation. Let's explore the tactics and tooling I used at Nintendo and beyond to prototype game proof-of-concepts and iterate quickly in Swift & SwiftUI!
ja: アプリやゲームのアイデアが実装する時間を上回る場合、AIはコード、アセット、テスト、ドキュメントの自動生成を通じて、ワークフローを大幅に加速させます。 本セッションでは、Nintendoなどで実践したSwiftおよびSwiftUIを活用し、ゲームの概念実証プロトタイプを迅速に構築・反復開発するための戦略とツールについて探求します。

source: With iPhones continually advancing their camera capabilities, one can capture satisfying photos without the need for a dedicated digital camera. Yet, there exists a niche of individuals who intentionally purchase older digital or film cameras. They are drawn to the unique aesthetic of photos and videos produced by these cameras. In this talk, we'll explore how to achieve such retro-style photos using Swift. While Core Image's documentation offers articles like "Simulating Scratchy Analog Film," implementing these techniques directly into a camera app may not yield the desired retro effect. Therefore, we'll start by reexamining the question, "What defines a retro-style photo?" and aim to create the ideal retro aesthetic.
ja: iPhoneのカメラは進化を続けており、本格的なデジタルカメラを持たなくても満足できる程の写真を撮ることができる。そんな中あえて古めのデジカメやフィルムカメラを購入している層がある。彼らはそうしたカメラで撮れる写真や動画の味わいに惹かれているのである。 Swiftでそのような写真を生み出すにはどうしたら良いのだろうか。Core Imageのドキュメントに"Simulating Scratchy Analog Film"という記事はあるが、その通りに実装したカメラアプリでは思うような「レトロ」が作れない。そもそも「レトロな写真とは何なのか」という問いから再考し、理想の「レトロ」を作ろうと思う。

source: With over 12 years of experience developing for Apple platforms, I am passionate about creating exceptional user experiences. I have a strong background in UIKit, and these days, I primarily focus on coding SwiftUI views for iOS and tvOS apps. I currently work at Rakuten Viki, a video streaming company with over a million active users per day. I absolutely love attending conferences and public speaking, sharing my knowledge and learning from the community. Outside of work, you can find me planning my next travel adventure or running around with my 3-year-old.
ja: Appleプラットフォーム向けの開発経験が12年以上あり、優れたユーザー体験を生み出すことに情熱を注いでいます。特にUIKitに精通しており、現在は主にSwiftUIを使ってiOSやtvOSアプリのUIを開発しています。 現在、1日あたり100万人以上のアクティブユーザーを抱える動画ストリーミング企業Rakuten Vikiに勤務しています。 カンファレンスへの参加や登壇が大好きで、知識を共有したり、コミュニティから学んだりすることに喜びを感じています。仕事以外では、次の旅行の計画を立てたり、3歳の子どもと遊んだりしています。

source: WWDC24 introduced exciting updates to the Charts API, enabling more creative graph representations. This talk explores how to turn data into art using advanced customization, animations, and interactions. Elevate your data visualization skills and become a graph art designer with Charts API!
ja: WWDC24では、Charts APIに画期的なアップデートが導入され、より創造的なグラフ表現が可能になりました。 このトークでは、先進的なカスタマイズ、アニメーション、そしてインタラクションを駆使して、データをアートに変える方法をご紹介します。 データビジュアライゼーションのスキルを一段と向上させ、Charts APIを使ったグラフアートのデザイナーになりましょう！

source: Xiangyu works at Duolingo and belongs to Max Immersion team, which develops the GPT-based subscription feature called Roleplay. She develops new improvements and features for Roleplay, mostly on iOS. Apart from being a full-stack software developer, She enjoys most of my time playing the piano and reading. She loves learning languages. She speaks Chinese and English fluently and is learning French.
ja: XingyuはDuolingoで働いており、Roleplayと呼ばれるGPTベースのサブスクリプション機能を開発しているMax Immersionチームに所属しています。彼女はRoleplayの新しい改良と機能を、主にiOS上で開発しています。 フルスタックのソフトウェア開発者であることとは別に、ピアノを弾いたり読書をしたりしています。 言語を学ぶのも好きです。中国語と英語は流暢に話せますし、フランス語も勉強中です。

source: You will learn how MESON's launch title for Apple Vision Pro is made with hands-on experience. We will also talk a bit about how we develop in Unity (PolySpatial).
ja: MESONがリリースしたApple Vision Pro向けローンチタイトルがどのようにしてできているかを、手を動かしながら学べる内容です。 また、Unity（PolySpatial）でどう開発していくのかを少しだけお話します。

source: Yuta is a software engineer at Goodnotes, an open-source developer, and a graduate CS student. He has been contributing to Swift / Ruby / LLVM for WebAssembly support.
ja: Goodnotesのソフトウェアエンジニア、オープンソース開発者、CS大学院生。WebAssemblyをサポートするためにSwift / Ruby / LLVMに貢献している。

source: Zamzam is a tech lead with deep knowledge in AI and mobile technology, currently advancing her expertise at Veo Technologies in Copenhagen. A movie enthusiast post-work
ja: AIとモバイル技術に深い知識を持つ技術リーダーで、現在はコペンハーゲンのVeo Technologiesで専門知識を深めている。仕事の後は映画愛好家。
